# Дана последовательность из N целых чисел и число K.
# Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо,
# K – положительное число.

listik = [1, 2, 3, 4, 5, 6]

k = int(input('Input number: '))

for i in range(k):
    listik.insert(0, listik.pop(-1))

print(listik)

# [6, 1, 2, 3, 4, 5] - 1 step
# [5, 6, 1, 2, 3, 4] - 2 step
# [4, 5, 6, 1, 2, 3] - 3 step
# [3, 4, 5, 6, 1, 2] - 4 step
# [2, 3, 4, 5, 6, 1] - 5 step
# [1, 2, 3, 4, 5, 6] - 6 step